################### input-1##################
1c1,30
< SymTable:
---
> Defined symbol: xy=2 (Module 0, relative 2)
> Use list symbol: z
> Use list symbol: xy
> Instruction: R 1004
> Instruction: I 5678
> Instruction: E 2000
> Instruction: R 8002
> Instruction: E 7001
> Processed module 0 -- base address 0, size 5
> Use list symbol: z
> Instruction: R 8001
> Instruction: E 1000
> Instruction: E 1000
> Instruction: E 3000
> Instruction: R 1002
> Instruction: A 1010
> Processed module 1 -- base address 5, size 6
> Use list symbol: z
> Instruction: R 5001
> Instruction: E 4000
> Processed module 2 -- base address 11, size 2
> Defined symbol: z=15 (Module 3, relative 2)
> Use list symbol: xy
> Use list symbol: z
> Instruction: A 8000
> Instruction: E 1001
> Instruction: E 2000
> Processed module 3 -- base address 13, size 3
> 
> Symbol Table
4,23d32
< 
< BinaryCode:
< 000: 1004
< 001: 5678
< 002: 2015
< 003: 8002
< 004: 7002
< 005: 8006
< 006: 1015
< 007: 1015
< 008: 3015
< 009: 1007
< 010: 1010
< 011: 5012
< 012: 4015
< 013: 8000
< 014: 1015
< 015: 2002
< 
< Summary: Errors=0 Warnings=0
################### input-2##################
1c1,30
< SymTable:
---
> Defined symbol: xy=2 (Module 0, relative 2)
> Use list symbol: z
> Use list symbol: xy
> Instruction: R 1004
> Instruction: I 5678
> Instruction: E 2000
> Instruction: 0 8002
> Instruction: E 7001
> Processed module 0 -- base address 0, size 5
> Use list symbol: z
> Instruction: R 8001
> Instruction: E 1000
> Instruction: 0 1000
> Instruction: E 3000
> Instruction: R 1002
> Instruction: A 1010
> Processed module 1 -- base address 5, size 6
> Use list symbol: z
> Instruction: 5 5001
> Instruction: E 4000
> Processed module 2 -- base address 11, size 2
> Defined symbol: z=15 (Module 3, relative 2)
> Use list symbol: xy
> Use list symbol: z
> Instruction: A 8000
> Instruction: E 1001
> Instruction: E 2000
> Processed module 3 -- base address 13, size 3
> 
> Symbol Table
4,23d32
< 
< BinaryCode:
< 000: 1004
< 001: 5678
< 002: 2015
< 003: 8002
< 004: 7002
< 005: 8006
< 006: 1015
< 007: 1015
< 008: 3015
< 009: 1007
< 010: 1010
< 011: 5012
< 012: 4015
< 013: 8000
< 014: 1015
< 015: 2002
< 
< Summary: Errors=0 Warnings=0
################### input-3##################
1c1,61
< SymTable:
---
> Defined symbol: X11=6 (Module 0, relative 6)
> Defined symbol: X12=8 (Module 0, relative 8)
> Defined symbol: X13=9 (Module 0, relative 9)
> Use list symbol: X22
> Use list symbol: X31
> Instruction: R 1000
> Instruction: E 1001
> Instruction: E 1000
> Instruction: E 1001
> Instruction: E 1000
> Instruction: E 1000
> Instruction: A 1006
> Instruction: R 1007
> Instruction: A 1008
> Instruction: R 1009
> Processed module 0 -- base address 0, size 10
> Defined symbol: X21=10 (Module 1, relative 0)
> Defined symbol: X22=12 (Module 1, relative 2)
> Defined symbol: X23=15 (Module 1, relative 5)
> Use list symbol: X11
> Use list symbol: X13
> Use list symbol: X31
> Instruction: E 2001
> Instruction: E 2000
> Instruction: R 2002
> Instruction: E 2000
> Instruction: E 2001
> Instruction: R 2005
> Instruction: E 2001
> Instruction: E 2002
> Processed module 1 -- base address 10, size 8
> Defined symbol: X31=20 (Module 2, relative 2)
> Instruction: A 3000
> Instruction: I 3701
> Instruction: A 3002
> Processed module 2 -- base address 18, size 3
> Use list symbol: X31
> Use list symbol: X11
> Use list symbol: X22
> Instruction: R 4000
> Instruction: E 4000
> Instruction: E 4001
> Instruction: R 4003
> Instruction: R 4004
> Instruction: E 4002
> Processed module 3 -- base address 21, size 6
> Instruction: R 5000
> Instruction: I 5887
> Instruction: R 5002
> Processed module 4 -- base address 27, size 3
> Defined symbol: X61=32 (Module 5, relative 2)
> Use list symbol: X31
> Instruction: R 6000
> Instruction: E 6000
> Instruction: A 6002
> Instruction: A 6003
> Instruction: R 6004
> Instruction: I 6005
> Processed module 5 -- base address 30, size 6
> 
> Symbol Table
10,54d69
< 
< BinaryCode:
< 000: 1000
< 001: 1020
< 002: 1012
< 003: 1020
< 004: 1012
< 005: 1012
< 006: 1006
< 007: 1007
< 008: 1008
< 009: 1009
< 010: 2009
< 011: 2006
< 012: 2012
< 013: 2006
< 014: 2009
< 015: 2015
< 016: 2009
< 017: 2020
< 018: 3000
< 019: 3701
< 020: 3002
< 021: 4021
< 022: 4020
< 023: 4006
< 024: 4024
< 025: 4025
< 026: 4012
< 027: 5027
< 028: 5887
< 029: 5029
< 030: 6030
< 031: 6020
< 032: 6002
< 033: 6003
< 034: 6034
< 035: 6005
< 
< Warning: Module 0: X12 was defined but never used
< Warning: Module 1: X21 was defined but never used
< Warning: Module 1: X23 was defined but never used
< Warning: Module 5: X61 was defined but never used
< 
< Summary: Errors=0 Warnings=4
################### input-4##################
0a1,8
> Use list symbol: X21
> Instruction: E 2000
> Instruction: E 2000
> Instruction: E 2000
> Processed module 0 -- base address 0, size 3
> Defined symbol: X21=3 (Module 1, relative 0)
> Instruction: A 2936
> Processed module 1 -- base address 3, size 1
2,3c10,11
< SymTable:
< X21=3 Error: This variable is multiple times defined; first value used
---
> Instruction: I 3465
> Processed module 2 -- base address 4, size 1
5,12c13,14
< BinaryCode:
< 000: 2003
< 001: 2003
< 002: 2003
< 003: 2000 Error: Absolute address exceeds machine size; zero used
< 004: 3465
< 
< Summary: Errors=2 Warnings=1
---
> Symbol Table
> X21=3
################### input-5##################
1,9c1,10
< SymTable:
< X21=4
< 
< BinaryCode:
< 000: 1000 Error: X31 is not defined; zero used
< 001: 1000 Error: X31 is not defined; zero used
< 002: 1000 Error: X31 is not defined; zero used
< 003: 2000 Error: Absolute address exceeds machine size; zero used
< 004: 3456
---
> Use list symbol: X31
> Instruction: E 1000
> Instruction: E 1000
> Instruction: E 1000
> Processed module 0 -- base address 0, size 3
> Instruction: A 2956
> Processed module 1 -- base address 3, size 1
> Defined symbol: X21=4 (Module 2, relative 0)
> Instruction: I 3456
> Processed module 2 -- base address 4, size 1
11,13c12,13
< Warning: Module 2: X21 was defined but never used
< 
< Summary: Errors=4 Warnings=1
---
> Symbol Table
> X21=4
################### input-6##################
1,10c1,11
< SymTable:
< X21=3
< X11=4
< 
< BinaryCode:
< 000: 1003
< 001: 1003
< 002: 1003
< 003: 2000 Error: Absolute address exceeds machine size; zero used
< 004: 3004 Error: Relative address exceeds module size; relative zero used
---
> Use list symbol: X21
> Instruction: E 1000
> Instruction: E 1000
> Instruction: E 1000
> Processed module 0 -- base address 0, size 3
> Defined symbol: X21=3 (Module 1, relative 0)
> Instruction: A 2956
> Processed module 1 -- base address 3, size 1
> Defined symbol: X11=4 (Module 2, relative 0)
> Instruction: R 3056
> Processed module 2 -- base address 4, size 1
12,14c13,15
< Warning: Module 2: X11 was defined but never used
< 
< Summary: Errors=2 Warnings=1
---
> Symbol Table
> X11=4
> X21=3
################### input-7##################
1c1,13
< SymTable:
---
> Use list symbol: X21
> Instruction: E 1000
> Instruction: E 1004
> Instruction: E 1222
> Processed module 0 -- base address 0, size 3
> Defined symbol: X21=3 (Module 1, relative 0)
> Instruction: A 2956
> Processed module 1 -- base address 3, size 1
> Defined symbol: x31=4 (Module 2, relative 0)
> Instruction: R 3456
> Processed module 2 -- base address 4, size 1
> 
> Symbol Table
4,14d15
< 
< BinaryCode:
< 000: 1003
< 001: 1000 Error: External operand exceeds length of uselist; treated as relative=0
< 002: 1000 Error: External operand exceeds length of uselist; treated as relative=0
< 003: 2000 Error: Absolute address exceeds machine size; zero used
< 004: 3004 Error: Relative address exceeds module size; relative zero used
< 
< Warning: Module 2: x31 was defined but never used
< 
< Summary: Errors=4 Warnings=1
################### input-8##################
1c1,5
< SymTable:
---
> Use list symbol: X21
> Instruction: E 1001
> Instruction: E 1004
> Instruction: E 1222
> Processed module 0 -- base address 0, size 3
3,9c7
< BinaryCode:
< 000: 1000 Error: External operand exceeds length of uselist; treated as relative=0
< 001: 1000 Error: External operand exceeds length of uselist; treated as relative=0
< 002: 1000 Error: External operand exceeds length of uselist; treated as relative=0
< Warning: Module 0: uselist[0]=X21 was not used
< 
< Summary: Errors=3 Warnings=1
---
> Symbol Table
################### input-9##################
1,10c1,11
< SymTable:
< X31=1
< 
< BinaryCode:
< 000: 2001
< Warning: Module 0: uselist[0]=X31 was not used
< 001: 3001
< 002: 4001
< Warning: Module 2: uselist[0]=X32 was not used
< Warning: Module 2: uselist[2]=X32 was not used
---
> Use list symbol: X31
> Instruction: I 2001
> Processed module 0 -- base address 0, size 1
> Defined symbol: X31=1 (Module 1, relative 0)
> Instruction: I 3001
> Processed module 1 -- base address 1, size 1
> Use list symbol: X32
> Use list symbol: X31
> Use list symbol: X32
> Instruction: E 4001
> Processed module 2 -- base address 2, size 1
12c13,14
< Summary: Errors=0 Warnings=3
---
> Symbol Table
> X31=1
################### input-10##################
1,5c1,14
< Warning: Module 0: zombie=6 valid=[0..2] assume zero relative
< Warning: Module 1: xy=8 valid=[0..4] assume zero relative
< SymTable:
< zombie=0
< xy=3
---
> Defined symbol: zombie=6 (Module 0, relative 6)
> Instruction: I 1000
> Instruction: I 2000
> Instruction: I 3000
> Processed module 0 -- base address 0, size 3
> Defined symbol: xy=11 (Module 1, relative 8)
> Use list symbol: z
> Use list symbol: xy
> Instruction: R 1004
> Instruction: I 5678
> Instruction: E 2000
> Instruction: R 8002
> Instruction: E 7001
> Processed module 1 -- base address 3, size 5
7,19c16,18
< BinaryCode:
< 000: 1000
< 001: 2000
< 002: 3000
< 003: 1007
< 004: 5678
< 005: 2000 Error: z is not defined; zero used
< 006: 8005
< 007: 7003
< 
< Warning: Module 0: zombie was defined but never used
< 
< Summary: Errors=1 Warnings=3
---
> Symbol Table
> xy=11
> zombie=6
################### input-11##################
1d0
< Parse Error line 3 offset 5: SYM_EXPECTED
################### input-12##################
1d0
< Parse Error line 3 offset 8: MARIE_EXPECTED
################### input-13##################
1d0
< Parse Error line 1 offset 2: SYM_EXPECTED
################### input-14##################
1c1,6
< Parse Error line 1 offset 5: NUM_EXPECTED
---
> Defined symbol: z=0 (Module 0, relative 0)
> Instruction: I 400
> Processed module 0 -- base address 0, size 1
> 
> Symbol Table
> z=0
################### input-16##################
1d0
< Parse Error line 2 offset 1: TOO_MANY_USE_IN_MODULE
################### input-17##################
1d0
< Parse Error line 7 offset 1: TOO_MANY_INSTR
################### input-18##################
1c1,18
< SymTable:
---
> Defined symbol: a=2 (Module 0, relative 2)
> Defined symbol: b=2 (Module 0, relative 2)
> Use list symbol: x
> Use list symbol: y
> Instruction: M 1
> Instruction: E 9000
> Instruction: E 4001
> Processed module 0 -- base address 0, size 3
> Defined symbol: x=4 (Module 1, relative 1)
> Defined symbol: y=5 (Module 1, relative 2)
> Use list symbol: a
> Use list symbol: b
> Instruction: M 0
> Instruction: E 8001
> Instruction: E 4000
> Processed module 1 -- base address 3, size 3
> 
> Symbol Table
6,15d22
< 
< BinaryCode:
< 000: 0003
< 001: 9004
< 002: 4005
< 003: 0000
< 004: 8002
< 005: 4002
< 
< Summary: Errors=0 Warnings=0
################### input-19##################
1c1,11
< SymTable:
---
> Instruction: R 10002
> Instruction: I 10002
> Instruction: I 40008
> Instruction: I 0
> Instruction: R 3001
> Processed module 0 -- base address 0, size 5
> Instruction: I 9900
> Instruction: M 4000
> Instruction: M 4001
> Instruction: M 4002
> Processed module 1 -- base address 5, size 4
3,14c13
< BinaryCode:
< 000: 9999 Error: Illegal opcode; treated as 9999
< 001: 9999 Error: Illegal opcode; treated as 9999
< 002: 9999 Error: Illegal opcode; treated as 9999
< 003: 0000
< 004: 3001
< 005: 9999 Error: Illegal immediate operand; treated as 999
< 006: 4000
< 007: 4005
< 008: 4000 Error: Illegal module operand ; treated as module=0
< 
< Summary: Errors=5 Warnings=0
---
> Symbol Table
################### input-20##################
1,9c1,7
< SymTable:
< bourbon=1
< 
< BinaryCode:
< 000: 0002
< 001: 0002
< 002: 0008
< 003: 0000
< Warning: Module 0: uselist[0]=whiskey was not used
---
> Defined symbol: bourbon=1 (Module 0, relative 1)
> Use list symbol: whiskey
> Instruction: R 2
> Instruction: I 2
> Instruction: I 8
> Instruction: I 0
> Processed module 0 -- base address 0, size 4
11,13c9,10
< Warning: Module 0: bourbon was defined but never used
< 
< Summary: Errors=0 Warnings=2
---
> Symbol Table
> bourbon=1
